Panda

In [55]:
import pandas as pd
import numpy as np

In [56]:
#series - one dimenational
data = [1,2,3,4,5]
series = pd.Series(data)
print("series :- \n",series)

series :-
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [57]:
#create a series from dictionary: 
dict = {'a':1,'b':2,'c':3}
series = pd.Series(dict)
print(series)

a    1
b    2
c    3
dtype: int64

In [58]:
data = [10,20,30]
index =['a','b','c']
data = pd.Series(data,index=index);
print(data)

a    10
b    20
c    30
dtype: int64

In [59]:
#dataframe = two dimentional 
data = {
    'Name' : ['krish','john','jack'],
    'age' : [25,39,10],
    'city' : ["uk",'delhi','rcb']
}
df = pd.DataFrame(data)
print(df)

    Name  age   city
0  krish   25     uk
1   john   39  delhi
2   jack   10    rcb

In [60]:
data = [
    {'Name':'krish','age': 36,'city':'dehradun'},
    {'Name':'rahul','age': 32,'city':'banglore'},
    {'Name':'mohan','age': 39,'city':'uk'},
]
df = pd.DataFrame(data)
print(df)

    Name  age      city
0  krish   36  dehradun
1  rahul   32  banglore
2  mohan   39        uk

In [61]:
ndf = pd.read_csv('1.csv', quotechar='"')
ndf.head(5)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,8/24/2020,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,4/23/2021,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,(496)978-3969x58947,beckycarr@hogan.com,3/25/2020,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,-9892,stanleyblackwell@benson.org,6/2/2020,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,4/17/2021,https://goodwin-ingram.com/

In [62]:
ndf.tail(5)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,1/30/2022,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,605.413.3198,vkemp@ferrell.com,7/10/2021,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,9/18/2021,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,8/11/2021,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,3/11/2020,http://www.hatfield-saunders.net/

In [63]:
df

    Name  age      city
0  krish   36  dehradun
1  rahul   32  banglore
2  mohan   39        uk

In [64]:
df['Name']

0    krish
1    rahul
2    mohan
Name: Name, dtype: object

In [65]:
df.loc[0]

Name       krish
age           36
city    dehradun
Name: 0, dtype: object

In [66]:
df.iloc[0][2]

C:\Users\RAHUL JOSHI\AppData\Local\Temp\ipykernel_12920\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'dehradun'

In [67]:
df.at[1,'Name']

'rahul'

In [68]:
df.iat[2,2]

'uk'

In [86]:

#addubg a column 
df['salary'] = [50000,60000,70000]
df

    Name  age      city  salary
0  krish   38  dehradun   50000
1  rahul   34  banglore   60000
2  mohan   41        uk   70000

In [88]:
#remove a col

df.drop('salary',axis = 1)

    Name  age      city
0  krish   38  dehradun
1  rahul   34  banglore
2  mohan   41        uk

In [89]:
df['age'] = df['age']+1
df

    Name  age      city  salary
0  krish   39  dehradun   50000
1  rahul   35  banglore   60000
2  mohan   42        uk   70000

In [90]:
df.drop(0)

    Name  age      city  salary
1  rahul   35  banglore   60000
2  mohan   42        uk   70000

In [91]:
df.describe()

             age   salary
count   3.000000      3.0
mean   38.666667  60000.0
std     3.511885  10000.0
min    35.000000  50000.0
25%    37.000000  55000.0
50%    39.000000  60000.0
75%    40.500000  65000.0
max    42.000000  70000.0